Tekla.Structures.DrawingInternal.Tools.DrawingCreationEventUtility.ExportDrawingCreationParametersAsIntList(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Exports the drawing creation parameters as a list of strings based on the specified operation type.
operationType: The type of the operation to be performed.
Remarks:
If the operation type is Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_INSERT or Tekla.Structures.DrawingInternal.QueryTypeEnum.AUTOMATION_RUN_AUTODRAWINGS, it exports a list of creation tracking parameters.